FemDesign.Calculate.FdScript
fdscript.xsd
fdscript root

FemDesign.Calculate.FdScript.#ctor
Parameterless constructor for serialization.

FemDesign.Calculate.FdScript.CalculateStruxml(System.String,FemDesign.Calculate.CmdUserModule,System.Collections.Generic.List{System.String},System.String,System.Boolean,FemDesign.Calculate.CmdGlobalCfg)
Create fdscript to perform a calculation.

FemDesign.Calculate.FdScript.ReadStr(System.String,System.Collections.Generic.List{System.String})
Create fdscript to read a str-model.

FemDesign.Calculate.FdScript.Analysis(System.String,FemDesign.Calculate.Analysis,System.Collections.Generic.List{System.String},System.String,System.Boolean,FemDesign.Calculate.CmdGlobalCfg)
Create fdscript to run analysis.

FemDesign.Calculate.FdScript.Design(System.String,System.String,FemDesign.Calculate.Analysis,FemDesign.Calculate.Design,System.Collections.Generic.List{System.String},System.String,System.Boolean,FemDesign.Calculate.CmdGlobalCfg)
Create fdscript to run analysis and design.

FemDesign.Calculate.FdScript.CreateDocumentation(System.String,System.String,System.Boolean)
Generate a FEM-Design documentation.
strPath: The .str file to generate base the documentation on.
docxTemplatePath: The .docx template path for the documentation.
endSession: Close the FEM-Design program after successfully generating documentation.
Returns: An FemDesign.Calculate.FdScript for generating documentation.

FemDesign.Calculate.FdScript.SerializeFdScript
Serialize fdscript.